app/controllers/songs_controller.rb

  def new
    if params[:artist_id] && !Artist.exists?(params[:artist_id])
---
SELECT  1 AS one FROM "artists" LIMIT 1
SELECT "artists".* FROM "artists"

  def edit
    if params[:artist_id]
      @artist = Artist.find_by(id: params[:artist_id])
      if @artist.nil?
        redirect_to artists_path, alert: "Artist Not Found."
      else
        @song = @artist.songs.find_by(id: params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1234]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 1234]]